import Foundation

// 1. Создать тюпл с тремя параметрами:
//
// - максимальное количество отжиманий
// - максимальное количество подтягиваний
// - максимальное количество приседаний
//
// Заполните его своими достижениями :)
//
// Распечатайте его через print()
//
// 2. Также сделайте три отдельных вывода в консоль для каждого параметра
// При том одни значения доставайте по индексу, а другие по параметру
//
// 3. Создайте такой же тюпл для другого человека (супруги или друга)
// с такими же параметрами, но с другими значениями
//
// 4. Создайте третий тюпл с теми же параметрами, но значения это разница
// между соответствующими значениями первого и второго тюплов

